/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print.h                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jrim <jrim@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/09/08 19:20:20 by jrim              #+#    #+#             */
/*   Updated: 2022/09/12 16:54:07 by jrim             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef PRINT_H
# define PRINT_H

# include "stdio.h"
# include "structures.h"

void    write_color(t_rgb pixel_color);		// rgb 값을 출력해주는 함수

#endif